Using the locally compiled provider the replacement of the previously created subscription using the official provider gave the following output:

```hcl
module.components.azurerm_subscription.azureSubscription: Refreshing state... [id=/providers/Microsoft.Subscription/aliases/<SUBSCRIPTION_ALIAS>]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.components.azurerm_subscription.azureSubscription must be replaced
-/+ resource "azurerm_subscription" "azureSubscription" {
      ~ alias             = "<SUBSCRIPTION_ALIAS>" -> (known after apply)
      ~ id                = "/providers/Microsoft.Subscription/aliases/<SUBSCRIPTION_ALIAS>" -> (known after apply)
      ~ subscription_id   = "<SUBSCRIPTION_ID>" -> (known after apply)
      ~ tags              = {} -> (known after apply)
      ~ tenant_id         = "<TENANT_ID>" -> (known after apply)
      + workload          = "DevTest" # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

Apparently the workload parameter was not used at all even though by my understanding of the documentation it should be set with "Production" as the default if not otherwise provided.